Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ཤར་ཕྱོགས་ཀྱི་སྒོར་ཕོ་ཉ་མོ་ཞིབ་ཕོ་ཉ་མོ་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བའོ། །ལྷོ་ཕྱོགས་ཀྱི་སྒོར་ནི་སྲིན་མོ་རལ་པ་གཅིག་མ་སྲིན་མོ་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བའོ། །ནུབ་ཕྱོགས་ཀྱི་སྒོར་རྡོ་རྗེ་ལུ་གུ་རྒྱུད་ལུ་གུ་རྒྱུད་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བའོ། །བྱང་ཕྱོགས་ཀྱི་སྒོར་ཁྲོ་གཉེར་ཅན་མོ་ཁྲོ་གཉེར་ཅན་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བའོ།
en: Śivadūtī with a retinue of seven dūtīs should be at the eastern door; the rākṣasī Ekajaṭī with a retinue of seven rākṣasīs should be at the southern door; Vajraśaṅkalī with a retinue of seven śaṅkalīs should be at the western door; and the queen Bhṛkuṭī with a retinue of seven bhṛkuṭīs should be at the northern door. “

source: །དེ་ནས་འཇིགས་པ་མེད་པས་མགོན་པོ་འཇིག་རྟེན་གྱི་བླ་མའི་གཟུགས་གསེར་གྱི་མདོག་ཅན་རིང་བསྲེལ་དང་ལྡན་པ་དོན་ཡོད་པའི་རྒྱལ་པོ་རྣམ་པར་འཕྲུལ་པའི་དཀྱིལ་འཁོར་གྱི་སྙིང་པོ་པདྨ་རྒྱ་ཆེན་པོའི་དཀྱིལ་འཁོར་དུ་གཞག་པར་བྱའོ།
en: The skilled vidyā holder should place a holy relic in the finished golden figure of the teacher, the protector of the world, and then place this miraculous figure of Amogharāja in the illustrious maṇḍala of the lotus family.

source: །གྲྭར་རྒྱལ་པོ་ཆེན་པོ་བཞི་སྟོབས་པོ་ཆེ་གོ་ཆ་བགོས་པ། དྲག་ཤུལ་གྱི་གཟུགས་ཅན། མཚོན་ཆ་འབར་བ་ཐོགས་པ་གཞག་པར་བྱའོ།
en: In the four corners inside the maṇḍala, he should place the Four Great Kings with their armies, each wearing coats of mail, fierce in appearance, blazing with flames, and holding weapons. “

source: །གང་ཞིག་ཐུབ་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་སྤྲུལ་པ། སྤྱིའི་རིགས་ཡང་དག་པར་འབྱུང་བ། དོན་ཡོད་པའི་རྒྱལ་པོ་རྣམ་པར་འཕྲུལ་པ། འཇིག་རྟེན་དབང་ཕྱུག་མཆོག་སྦྱིན་པ་དང་བཅས་པ། དོན་ཡོད་པའི་ཞགས་པ་རྣམ་པར་འཕྲུལ་པ་བསྒྲུབ་པའི་ཆེད་དུ་ཆོ་ག་སྣ་ཚོགས་དྲན་པར་བྱའོ།
en: Miraculous manifestations of the sage Vairocana, who arises from the all-encompassing tathāgata family, are known to be of many types, including the miraculously manifested Amogharāja and other boon-granting lokeśvaras miraculously emanated to facilitate the accomplishment of Amoghapāśa.

source: །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །རྣམ་ཐར་དཀྱིལ་འཁོར་དེ་ཉིད་ནི།
en: Amogharāja’s maṇḍala of liberation is truly for the benefit and welfare of all beings.

source: །ལེགས་པར་བསྒྲུབས་པ་མཐོང་ཙམ་དང་། །བཀླགས་པས་དངོས་གྲུབ་བླ་མེད་འགྱུར།
en: When this maṇḍala is successfully executed, the mere sight of it will produce the supreme accomplishment as described.

source: །དེ་བས་རྟག་ཏུ་འབད་པ་ཡིས། །སྒྲུབ་པར་བྱེད་པ་མི་མཁས་སོ།
en: Therefore, an intelligent person should continually engage in the relevant practice. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གཙང་མར་གྱུར་པ་ཤིན་ཏུ་ཁྲུས་བྱས་པ་གོས་གཙང་མ་བགོས་པས་དར་དང་བ་དན་སྣ་ཚོགས་བཟང་པོས་དཀྱིལ་འཁོར་བརྒྱན་པར་བྱའོ། །རོ་བྲོ་བའི་མཆོག་རྒྱ་ཆེན་པོས་སྣོད་སྣ་ཚོགས་ལེགས་པར་བཀང་བ་དང་།
en: The skilled vidyā holder—ritually pure, thoroughly bathed, and wearing clean clothes—should decorate the divine maṇḍala with various streamers and banners and set out various dishes filled with delicious foods of sublime flavors.

source: གསེར་དང་དངུལ་གྱི་སྣོད་དུ་མཆོད་ཡོན་དབུལ་ཞིང་རོ་སྣ་ཚོགས་ཀྱི་གཏོར་མ་གཞག་པར་བྱའོ། །དེ་བཞིན་དུ་འབྲས་བུ་སྣ་ཚོགས་གཞག་པར་བྱའོ།
en: He should also set out golden and silver bowls with argha water for the feet and the bali articles of various flavors, including a variety of fruits.

source: །གཟུགས་རྣམ་པ་སྣ་ཚོགས་པའི་ཁ་ཟས་ཀྱི་གཏོར་མ་ཡང་བསྒྲུབ་བོ།
en: The different forms and varieties of bali articles should be of exquisite flavor.

source: །མེ་ཏོག་སྣ་ཚོགས་བཀྲམ་ཞིང་གཏོར་མ་སྣ་ཚོགས་ཀྱིས་བཀང་བྲ་དང་། བུམ་པ་དང་། རྫེའུ་དང་། ཕོར་ཟླུམ་དང་།
en: The vidyā holder should strew the maṇḍala with various flowers.

source: ཁམ་ཕོར་དང་། དབྱིབ་མོ་དག་ཀྱང་དགང་ངོ་། །ཀུན་དུ་དྲི་ཆུས་བསྐོས་པ་ཡི། །རྒྱ་ཆེན་གཏོར་མ་ཀུན་དུའོ། །སྣ་ཚོགས་པ་ཡི་པོག་ཕོར་ནས།
en: Among the various vessels containing the bali, the skilled vidyā holder should include jars, pitchers, water pots, earthenware bowls, and pots, all filled with scented water and all kinds of bali articles. “

source: །སྣ་ཚོགས་བདུག་སྤོས་དབུལ་བ་ནི། །ཨ་ག་རུ་དང་། ཙནྡན་དང་། སྤྲྀ་ཀ་དང་། དུ་རུ་སྐ་དང་། ཀུན་ཏུ་རུ་དང་། གུ་གུལ་དང་། སྒྲོན་ཤིང་དང་། ཤྲི་བེཥྚ་ཀ་དང་། ས་ར་དང་། སར་ཛ་ར་ས་དང་། དེ་བཞིན་དུ་ག་བུར་དང་། གླ་རྩི་དང་། གུར་གུམ་དང་། ཤ་ཁ་རའི་བདུག་སྤོས་འདི་དག་ནི་རབ་ཏུ་ཕུལ། ཐམས་ཅད་དུ་སྒྲུབ་པ་བླ་ན་མེད་པ་ཡིན་ནོ།
en: He should burn various types of incense, such as agarwood, sandalwood, fenugreek, frankincense, olibanum, bdellium, nameru, pine resin, sarjarasa, camphor, musk, saffron, and sarkara. All these excellent types of incense are supreme aids to accomplishment.

source: །སྣ་ཚོགས་པ་ཡི་དྲི་དག་དང་། །ཕྱེ་མ་བྱུག་པ་སྣ་ཚོགས་ཉིད། །ཤེས་རབ་ཅན་གྱིས་ཀུན་ཏུ་ནི། །དཀྱིལ་འཁོར་དག་ལ་གཞག་པར་བྱ།
en: The knowledgeable vidyā holder should spread various fragrant substances, scented powders, and scented oils all around the maṇḍala.

source: །ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མེ་ཏོག་དང་། དངུལ་གྱི་མེ་ཏོག་དང་། ཟངས་ཀྱི་མེ་ཏོག་དང་། བྱི་རུ་དང་ནི་མུ་ཏིག་དང་། །ཨིནྡྲ་ནཱི་ལ་དག་དང་ནི། །པདྨ་རཱ་ག་དག་ཀྱང་ངོ་། །
en: He should set out flowers made of the seven precious jewels, silver and copper flowers, and coral, pearls, sapphires, and rubies.

source: གསེར་དང་དངུལ་གྱི་བུམ་པ་རིན་པོ་ཆེ་སྣ་བདུན་ཅན་ཡང་གྲྭ་བཞིར་གཞག་པར་བྱའོ། །
en: The jars placed in the four corners should be made of the seven precious jewels, silver, and gold. “

source: འབྲས་ཡོས་དང་། ཡུངས་ཀར་དང་བསྲེས་པས་དཀྱིལ་འཁོར་ཀུན་དུ་གཏོར་རོ། །ཀུན་ནས་མེ་ཏོག་ཕྲེང་བ་ནི། །རྨད་བྱུང་དཀྱིལ་འཁོར་ལ་གཞག་ཅིང་། །ཀུན་ནས་མར་མེའི་ཕྲེང་བ་ཡང་། །དཀྱིལ་འཁོར་རྨད་དུ་བྱུང་ལ་བཞག །
en: He should sprinkle a mixture of parched rice and mustard seeds all around this wondrous maṇḍala and surround it with flower garlands and rows of lamps.

source: རིག་སྔགས་འཆང་ཉིན་ཞག་གཅིག་གནས་པར་གྱུར་པས་ཡང་བཟླས་བརྗོད་རྒྱ་ཆེར་བྱས་ལ་ཆོ་གས་བསྲུང་བ་དང་།
en: Having fasted for one day and one night, he should perform the mantra recitation in full, and the protection rite according to procedure.

source: ཕྱོགས་བཅིང་བ་དང་། ཀུན་ནས་དཀྱིལ་འཁོར་བཅིང་བ་བྱས་ལ་དཀྱིལ་འཁོར་གྱི་ལས་བྱའོ། །
en: He should bind the directions and the entire maṇḍala and perform the required maṇḍala rites.

source: དེ་ནས་སློབ་མ་གཞུག་པར་བྱ་སྟེ།
en: Afterward, he should bring the disciples in.

source: བླ་མ་མཁན་པོ་འམ། སློབ་དཔོན་ནམ། ཕའམ་རྒྱལ་པོའམ། བློན་པོ་ཆེན་པོ་ལ་དམ་ཚིག་དང་། ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་གསང་བ་བསྟན་ཏེ།
en: As a teacher, master, and preceptor, he should show the secret samaya maṇḍala and the mudrā to his father, to the king, and to the royal ministers.

source: མགོན་པོ་འཇིག་རྟེན་གྱིས་བླ་མ་མཐོང་ཞིང་དཀྱིལ་འཁོར་རྨད་དུ་བྱུང་བ་མཐོང་ནས་ཕྱག་བྱ་ཞིང་མཆོད་པ་དང་། མེ་ཏོག་དང་། བདུག་སྤོས་དབུལ་བ་བྱས་ལ་བསྐོར་བ་བྱའོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་མཉམ་པར་བཞག་སྟེ།
en: Having thus shown them the Lord, the teacher of the world, and the wondrous maṇḍala, the vidyā holder, filled with joy and singularly focused on loving kindness, should offer flowers and the five types of incense, bow in homage, circumambulate the maṇḍala clockwise, and worship the deity.

source: སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་འདུག་ལ་མི་སྨྲ་བར་ཡ་མཚན་དུ་སྣང་བར་མཐོང་གི་བར་དུ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་བརྗོད་བྱས་ལ་
en: He should then sit in a cross-legged posture and, watching the wondrous sight, recite the heart essence mantra of Amoghapāśa one hundred and eight times.

source: དཀྱིལ་འཁོར་ཀུན་ཏུ་ཁྲོ་བོའི་རྒྱལ་པོས་ལན་བརྒྱ་རྩ་བརྒྱད་དབང་བསྐུར་ཞིང་ཡུངས་ཀར་དང་། ཆུ་དང་མེ་ཏོག་གིས་དཀྱིལ་འཁོར་ཀུན་ཏུ་ལན་བརྒྱ་རྩ་བརྒྱད་གཏོར་བའི་མོད་ལ་རྟག་ཏུ་ཕྱག་རྒྱ་ལན་བརྒྱ་རྩ་བརྒྱད་བཅིངས་ལ་
en: He should consecrate the maṇḍala with the mantra of Krodharāja, sprinkle it entirely one hundred and eight times with mustard seeds mixed with water and flower petals, and display the consecration mudrā, which is always done one hundred and eight times. “

source: དཀྱིལ་འཁོར་ཀུན་ཏུ་མེ་ཏོག་དང་། བདུག་སྤོས་དང་། དྲི་ཕུལ་ནས་མགོན་པོ་འཇིག་རྟེན་དབང་ཕྱུག་དོན་ཡོད་པའི་ཞགས་པ་མཐོང་ན་དོན་ཡོད་པ་ཉིད་མཆོད་པར་བྱའོ། །
en: The vidyā holder should offer flowers, incense, and fragrances, placing them all around the maṇḍala in worship of the lokeśvara lord Amoghapāśa while seeing him as a true amogha manifestation.

source: དེ་ནས་མགོན་པོ་ཕྱག་ན་རྡོ་རྗེ་དང་། རིག་སྔགས་ཀྱི་རྒྱལ་པོ་བླ་ན་མེད་པ་མཆོད་པ་བྱེད་དོ། །དེ་ནས་ལྷ་མོ་སྒྲོལ་མ་དང་། ཀུན་དུ་ལྷ་མོ་ཐམས་ཅད་ལའོ། །དེ་ནས་དཀྱིལ་འཁོར་གྱི་ལྷ་ཐམས་ཅད་ལའོ། །
en: After this he should worship the lord Vajrapāṇi, the supreme king of vidyās, then Tārā and all the goddesses, and then all the deities of the maṇḍala.

source: །དེ་ནས་ཁྲོ་བོ་ལྕགས་ཀྱུ་བླ་ན་མེད་པ། སྡིག་པ་ཐམས་ཅད་སེལ་བ། མོད་ལ་གདུག་པ་ཐམས་ཅད་འཇིགས་པར་བྱེད་པ། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། མོད་ལ་ཐམས་ཅད་དུ་གྲུབ་པ་བླ་ན་མེད་པ། ནད་ཐམས་ཅད་ཞི་བ།
en: “Now I will teach the unexcelled cloth painting of Krodhāṅkuśa that instantly eradicates all evil, removes all afflictions, pacifies all diseases, and brings the supreme accomplishment.

source: དེ་ཁོ་ན་ཉིད་ཁྲོ་བོ་ལྕགས་ཀྱུ་བླ་ན་མེད་པའི་རས་རིས་ཀྱི་སྐུ་གཟུགས་བརྗོད་པར་བྱ་སྟེ། རས་རིས་ཀྱི་སྐུ་གཟུགས་བླ་ན་མེད་པ་འདི་མཐོང་བ་ཙམ་གྱི་མོད་ལ། བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཐོབ་པ་དང་།
en: To see this painting is to see Krodhāṅkuśa in truth.

source: དགེ་བའི་རྩ་བ་ཆེན་པོ་བསྐྱེད་པར་འགྱུར་བ་དང་། རིག་པའི་གནས་ཐམས་ཅད་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་མཐོང་བ་དང་། མཆོད་པ་དང་། རིམ་གྲོར་བྱ་བ་དང་། ཞེ་སར་བྱ་བ་དང་།
en: By merely seeing this supreme cloth painting, the viewer accumulates a great amount of merit and plants roots of great virtue, the same as if he had visited all the vidyā power places, or if he had had an audience with, served, worshiped, and honored hundreds of millions of billions of tathāgatas, fully realized worthy buddhas, equaling in number the grains of sand in the ninety-two Gaṅgā rivers.

source: བླ་མར་བྱས་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱི་སྤྱན་སྔར་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོའི་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་འགྱུར་བ་དང་། རས་རིས་ཀྱི་སྐུ་གཟུགས་གང་ཡིན་པ་འདི་མཐོང་བ་ཙམ་གྱི་མོད་ལ། མཐས་ཀླས་པ་ཙམ་དང་འདི་མཚུངས་པར་འགྱུར་ཏེ། འདི་དང་མཚུངས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་རོ།
en: By merely seeing this cloth painting, he will accumulate the same great amount of merit and plant the same roots of virtue as he would in the presence of all these tathāgatas.

source: །དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། ལྷ་ཐམས་ཅད་ཀྱིས་དགོངས་པར་འགྱུར་རོ།
en: All the tathāgatas, bodhisattvas, and deities will care for such vidyā holder. “

source: །རས་གྲུ་བཞི་པ་གྲུ་བཞིར་ཆ་མཉམ་པ།
en: The vidyā holder should prepare a square canvas with all four sides perfectly equal.

source: ཤིན་ཏུ་ཐགས་བཟང་བ། ཤིན་ཏུ་གསར་བ། ཤིན་ཏུ་འཇམ་པ་མཆོག་ཏུ་མཛེས་པ།
en: It should be tightly woven, soft, smooth, and very fine.

source: ཁྲུ་གཉིས་པའི་ཚད་ཁ་ཚར་མ་བཅད་པ། སྐྲ་དང་བྲལ་བའམ།
en: It should be two cubits across, the fringe left untrimmed, and the loose threads removed.

source: ཡང་ན་དར་གཙང་མ་གྲུ་བཞི་ཤིན་ཏུ་རྣམ་པར་འབྱེས་པ་ལ།
en: Alternatively, he could prepare an exceedingly beautiful, four-sided canvas from pure silk.

source: རི་མོ་མཁན་གཙང་མ་སྨྱུང་བར་གནས་པས།
en: The painter should observe purity in his speech, wear clean clothes, be ritually pure, and observe the ritual fast.

source: ལྷག་མ་མ་ཡིན་པའི་ཚོན་སྣོད་གསར་པར་བཞག་ལ། ཚོན་སྣ་ཚོགས་རྣམ་པར་འབྱེས་པས། འཕགས་པ་དོན་ཡོད་ཞགས་པའི་ཁྲོ་བོ་ལྕགས་ཀྱུ་བྲི་བར་བྱའོ།
en: Using uncontaminated paints kept in new bowls, he should paint Noble Amoghapāśa-Krodhāṅkuśa using various distinct colors.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཞལ་བཞི་པ།
en: This form of Noble Avalokiteśvara should have four faces.

source: ཞལ་དང་པོ་ནི་ཞི་བ། སྤྱན་གསུམ་པ། རལ་པའི་ཅོད་པན་གྱིས་བརྒྱན་པ། འོད་དཔག་མེད་ཅོད་པན་དུ་འཆང་བ། ཟླ་བས་ཉེ་བར་མཛེས་པ།
en: The first face is peaceful, three-eyed, adorned with a topknot, and crowned with Amitābha and a crescent moon to his right.

source: ཕྱག་བཞི་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ།
en: He has four arms and is adorned with all ornaments. “

source: གཡས་པའི་ཞལ་དྲག་པོའི་གཟུགས་ཅན་འཇིགས་པར་བྱེད་པ། ཚེམས་ཀྱིས་མ་མཆུ་མནན་པ། དབུ་སྐྲ་གྱེན་དུ་བརྫེས་པའི་རལ་པའི་ཐོར་ཚུགས་ཀྱིས་བརྒྱན་པ།
en: The right face of Avalokiteśvara should be fierce and inspire dread, with teeth pressing on his lips and upward-flowing hair adorned with a topknot.

source: གཡོན་པ་དྲག་པོ་ཆེན་པོ་མཆེ་བ་གཙིགས་པ། ཞལ་རྣམ་པར་འགྱུར་བ།
en: The face on the left should be very fierce and grimace with bared, protruding fangs.

source: དབུ་སྐྲ་འཁྱིལ་ཞིང་གྱེན་དུ་བརྫེས་པའི་རལ་པ་ཀུན་ཏུ་བཅིངས་པ། འོད་དཔག་མེད་ཀྱི་ཅོད་པན་ཅན།
en: Its upward-flowing hair should be tied into a topknot and crowned with Amitābha.

source: དྲག་ཏུ་བཞད་པའོ།
en: This face laughs wildly.

source: །ཞི་བའི་ཞལ་རལ་པའི་ཅོད་པན་གྱིས་བརྒྱན་པའི་སྟེང་དུ། སྐུ་ཕྱེད་པའི་ཁྲོ་བོའི་རྒྱལ་པོ་འབར་བའི་སྙིང་པོར་ཆུད་པ་བྱ་སྟེ།
en: Above the middle, peaceful face that is adorned with a diadem on its topknot, the vidyā holder should paint the great Krodharāja enveloped in flames, with only half of his body visible.

source: སྐུ་ཨུཏྤ་ལ་སྔོན་པོའི་ཁ་དོག་ཅན། དབུ་སྐྲ་དམར་པོ་ཅུང་ཟད་འཁྱིལ་བ། འོད་དཔག་མེད་ཀྱི་ཅོད་པན་ཅན།
en: His body should have the color of blue lotus, and his wavy and curly red hair should be crowned with Amitābha.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ། ཕྱག་གཉིས་ཀྱི་གཅིག་གིས་རལ་གྲི་དང་། གཉིས་པས་ཐོ་བ་འབར་བ་ཅན་བྱའོ།
en: He should be adorned with all ornaments and have two hands, one holding a blazing sword and the other a blazing hammer. “

source: །ཕྱག་གཅིག་གིས་པདྨ་འཆང་བ་སྟེ། པདྨའི་གེ་སར་འབར་བའི་སྙེན་པ་ཅན་ནོ། །གཉིས་པས་ལྕགས་ཀྱུ་དང་མདུང་རྩེ་གསུམ་སྟེ། གཡས་པ་ནའོ།
en: In one of his right hands Krodhāṅkuśa holds a lotus with kernels and stamens enveloped in light.

source: །གཡོན་པས་ཁྲོ་བོ་ཆེན་པོ་དྲག་ཏུ་རྒོད་པའི་གཟུགས་ཅན།
en: In the other he holds a trident-goad.

source: དོན་ཡོད་པའི་ཞགས་པ་འཛིན་པའོ། །གཡས་པ་དབུགས་འབྱིན་པའི་རིན་པོ་ཆེ་ཆེན་པོའི་ཆར་འབེབས་པ།
en: In one of his left hands he holds the unfailing noose, and with the other he displays the mudrā of giving comfort and sends out a profuse rain of jewels.

source: ཕྱག་ཐམས་ཅད་འབར་བའི་སྙིང་པོ་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་པ་བྱ་སྟེ།
en: Each of his hands is enveloped in light and radiates light rays of various colors.

source: པདྨའི་གདན་ལ་སྐྱིལ་མོ་ཀྲུང་གིས་བཞུགས་པ་བྱའོ། །རྒྱ་མཚོའི་སྙིང་པོར་རི་རབ་ལ་གནས་པ། ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། ཉེ་དགའ་བོས་དཀྲིས་པ་བྱའོ།
en: He should be painted sitting in the paryaṅka posture on a lotus seat atop Mount Sumeru, around which the nāga kings Nanda and Upananda are coiled.

source: །ཉ་དང་ཆུ་སྲིན་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་དཀྲིས་པ། པདྨ་དང་། ཨུཏྤ་ལ་དང་། ཀུ་མུ་དང་།
en: The surrounding ocean is teeming with fish and sea animals and abounds in jewels, gems, and pink, blue, white, and red lotuses, as well as water lilies.

source: པདྨ་དཀར་པོས་གཅལ་དུ་བཀྲམ་པ།
en: It is graced by swans, cranes, ducks, and jīvaka birds. “

source: དང་པ་དང་། བཞད་དང་། ངུར་པ་དང་། ཤང་ཤང་ཏེའུས་ཁྱབ་པ་བྱའོ། །གཡས་ལོགས་སུ་ལྷ་མོ་སྒྲོལ་མ།
en: The goddess Tārā should be painted to Krodhāṅkuśa’s right, bowing her head toward him with folded hands.

source: དབུ་ཅུང་ཟད་དུད་པ། ཐལ་མོ་སྦྱར་བ་འཆང་བ། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ།
en: She is modest in her demeanor and adorned with all ornaments.

source: འཛེམ་བག་དང་བཅས་པ་བྱའོ། །དཀར་ཤམ་ཆེན་མོ་ཐལ་མོ་སྦྱར་ཏེ་ཅུང་ཟད་འདུད་པ།
en: Mahāśvetā should be depicted bowing toward him with folded hands.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ། འཛེམ་བག་དང་བཅས་པ་བྱའོ།
en: She is adorned with all ornaments and is of modest demeanor.

source: །སྲིན་མོ་ཆེན་མོ་རལ་པ་གཅིག་མ་ཁྲག་འཛག་པའི་ཐོད་པ་དང་།
en: The great rākṣasī Ekajaṭī should be drawn holding a skull cup moist with blood.

source: དྲག་མོ་དྲག་ཏུ་རྒོད་པ་བྱ་སྟེ།
en: She is wild and laughs loudly.

source: འབར་པའི་སྙིང་པོར་ཁྲོ་བོ་ལྕགས་ཀྱུ་ལ་བལྟ་བཞིན་པ།
en: Her gaze is directed at the blazing figure of Krodhāṅkuśa.

source: ལག་པ་བཞི་པ། ལག་ན་རལ་གྲི་དང་། དགྲ་སྟ་དང་། ཞགས་པ་དང་། རྡོ་རྗེ་ཐོགས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པར་བྱའོ།
en: She has four hands, in which she holds a sword, axe, noose, and vajra scepter, and is adorned with all ornaments. “

source: །གཡོན་ཕྱོགས་སུ་གནོད་སྦྱིན་གྱི་དབང་པོ་བྱ་སྟེ།
en: The lord of the yakṣas should be painted to Krodhāṅkuśa’s left.

source: ཞལ་ཁྲོ་གཉེར་ཅན་དྲག་པོ། དབུ་སྐྲ་གྱེན་དུ་བརྫེས་པ།
en: He frowns, is wild in appearance, and has upward-flowing hair.

source: འཇིགས་པར་བྱེད་པ། འབར་བའི་སྙིང་པོར་པུས་མོ་གཡས་པ་བཙུགས་པ།
en: Surrounded by flames and kneeling on his right knee, he inspires dread.

source: རལ་གྲི་དང་། དགྲ་སྟ་ཐོགས་པ། ཕྱག་གཉིས་ཐལ་མོ་སྦྱར་བ་འཆང་བ།
en: He holds a sword and an axe in two of his hands, while his other pair is folded in the añjali gesture.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ། ཁྲོ་བོའི་རྒྱལ་པོ་ལྕགས་ཀྱུ་ལ་ངེས་པར་བལྟ་བཞིན་པ།
en: He is adorned with all ornaments, and his gaze is directed at the figure of Krodha­rājāṅkuśa.

source: ཁོ་ར་ཁོར་ཡུག་ཏུ་འོད་འདོམ་གང་བ། འོད་ཟེར་སྣ་ཚོགས་འབར་བ་བྱའོ། །ལྕགས་ཀྱུ་དང་བཅས་པའི་ཁོ་ར་ཁོར་ཡུག་གི་སྟེང་དུ། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་།
en: The lord of the yakṣas should be painted with a halo of light extending around him for one fathom and emitting hook-shaped light rays of various colors in all directions. “

source: དབང་ཕྱུག་ཆེན་པོ་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་པོ་བྱ་སྟེ། མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཕུར་མ་ཐོགས་ཏེ།
en: Above them, the vidyā holder should draw Brahmā, Viṣṇu, Maheśvara, Yama, Varuṇa, and Kubera, each holding a vase with various flowers and worshiping Krodhāṅkuśa.

source: མཆོད་པ་བྱེད་བཞིན་པ་བྱའོ། །ཁྲོ་བོའི་རྒྱལ་པོ་དོན་ཡོད་ལྕགས་ཀྱུའི་རྒྱབ་ཏུ། རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱུང་བའི་ཤིང་ལྗོན་པ་བྱ་སྟེ། ཡལ་ག་དང་། འདབ་མ་དང་།
en: Behind Amoghāṅkuśa­krodha­rāja, he should draw a tree made of the seven precious jewels with branches, leaves, and twigs.

source: ལོ་མ་རྣམ་པར་བཀྲ་བར་བྱའོ། །ཁྲོ་བོའི་རྒྱལ་པོའི་ཞབས་ཀྱི་དྲུང་དུ། རིག་སྔགས་འཆང་བྱ་སྟེ། པུས་མོ་བཙུགས་པ་མེ་ཏོག་སྣ་ཚོགས་ཐོགས་ཤིང་།
en: The vidyā holder should draw himself kneeling at the foot of the lord of wrath, holding various exquisite flowers and a rosary and gazing at the lord of wrath.

source: ལག་ན་བགྲང་ཕྲེང་འཛིན་པ། ཁྲོ་བོའི་རྒྱལ་པོ་ལ་སྟེང་དུ་བལྟ་བཞིན་པ་བྱའོ། །ཞབས་གཉིས་པའི་དྲུང་གི་གནས་སུ་ཕོ་ཉ་མོ་བྱ་སྟེ། ཟུར་མིག་ཅན་དྲག་མོ། ལག་ན་རལ་གྲི་ཐོགས་པ།
en: He should draw the fierce Dūtī at the Lord’s other foot, glancing sidelong and holding a sword.

source: རྣམ་པར་འགྱུར་བ་ཕྱག་ཐལ་མོ་སྦྱར་བ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་བྱའོ།
en: Her face is contorted, and her hands are folded in salutation. She is adorned with all ornaments. “

source: །རས་རིས་ཀྱི་སྐུ་གཟུགས་ཀྱི་བྱ་བ་ཡོངས་སུ་མཐར་ཕྱིན་ནས། བྱིན་གྱིས་བརླབས་ཏེ། དེའི་འོག་ཏུ་གསང་བའི་གནས་སུ་གཞག་པར་བྱའོ།
en: When all the stages of the painting have been fully completed and approved, the vidyā holder should install it in a secret place.

source: །དེའི་དྲུང་དུ་གཙང་མས་ཟས་མི་བཟའ་བར། དེའི་སྤྱན་སྔར་ཁྲོ་བོ་ལྕགས་ཀྱུ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱ་སྟེ།
en: Maintaining ritual purity and abstaining from food, he should recite the mantra in front of the picture of Krodhāṅkuśa one hundred and eight times.

source: མེ་ཏོག་དང་། བདུག་པ་དང་། མཆོད་ཡོན་དང་། ཞབས་བསིལ་ཇི་ལྟར་རྙེད་པ་དབུལ་བར་བྱའོ།
en: He should offer whatever flowers, incense, and argha water for the feet may be available.

source: །རས་རིས་ཀྱི་སྐུ་གཟུགས་སྒྲུབ་པའི་ཆོ་ག་འདིས་སྒྲུབ་པའི་ཆོ་ག་རྒྱས་པ་གཞན་ཡང་བྱའོ།
en: The practice of this painting procedure will bring wealth; there is no need to perform other elaborate procedures.

source: །དེའི་འོག་ཏུ་རིག་སྔགས་འཆང་གིས་ཉི་མ་རེ་རེར་རས་རིས་ཀྱི་མདུན་དུ། གཙང་མས་ཟས་མི་ཟ་བར། དེའི་སྤྱན་སྔར་མེ་ཏོག་དང་། བདུག་སྤོས་ཕུལ་ནས། ཁྲོ་བོའི་རྒྱལ་པོ་ལན་གཅིག་བཟླས་པར་བྱའོ།
en: Therefore the vidyā holder, maintaining ritual purity and abstaining from food, should offer flowers and incense to the painting daily and mindfully repeat the mantra of Krodharāja one time in front of the painting.

source: །དེ་ནས་ལས་ཐམས་ཅད་དང་དགོས་པ་ཐམས་ཅད་བྱའོ།
en: He can then perform all activities and accomplish all tasks.

source: །འདི་ནི་དེ་ཁོ་ན་ཉིད་ཀྱི་དངོས་གྲུབ་བཀླགས་པས་གྲུབ་པ་སྟེ།
en: This practice, once learned, will bring genuine results.

source: རིག་སྔགས་འཆང་གིས། གསང་བ་མཆོག་གི་ལས་བསྒྲུབ་པ་བྱའོ།
en: If the vidyā holder performs it in utmost secrecy, he will accomplish his activities. “

source: །དེ་ནས་སྐུ་གཟུགས་མཐོང་བ་ཙམ་ལ་སོགས་པས་མཚམས་མེད་པ་ལྔ་དང་། མནར་མེད་པ་ལ་གཞོལ་བ་དང་། དམ་པའི་ཆོས་སྤོང་བ་རྣམས་འདི་མཐོང་བ་ཙམ་གྱིས་ཐམས་ཅད་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: The first time that one simply beholds the cloth painting, all five acts of immediate retribution that lead to rebirth in the Avīci hell and all the acts of opposing the true Dharma will be completely purified.

source: །སྡིག་པ་ཐམས་ཅད་དང་། སྒྲིབ་པ་ཐམས་ཅད་དང་། སྔོན་གྱི་སྒྲིབ་པ་བསགས་པ་དང་བཅས་པ་དང་། བསྐལ་པ་བརྒྱར་བསགས་པའི་སྡིག་པ་དེ་དག་ཐམས་ཅད་རྣམ་པར་འཇིག་པར་འགྱུར་རོ།
en: All one’s wrongdoings and obscurations accumulated over hundreds of eons, and all negativity, will be eradicated.

source: །ནད་དང་འཇིགས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ། །སྡིག་པ་ཐམས་ཅད་དང་། དགྲ་ཐམས་ཅད་དང་། ཕྱིར་རྒོལ་བ་ཐམས་ཅད་དང་། མི་མཛའ་བ་རྣམ་པར་འཇིག་པར་འགྱུར་རོ། །རས་རིས་ཀྱི་སྐུ་གཟུགས་ཤིན་ཏུ་ཆུང་བ་བྱེད་པ་གང་ཡིན་པ་དེ་ཡང་ཕན་པ་བྱེད་པར་འགྱུར་ཏེ། མེ་ཏོག་གམ། བདུག་པ་དང་། དྲིའམ། བྱུག་པའམ། དཀྱིལ་འཁོར་དང་བཅས་པ་བྱེད་པའམ། ཁྲུས་ཀྱི་བུམ་པ་གང་བཀོད་པའམ། རྡུལ་སེལ་བར་བྱེད་པ་ཙམ་ཡང་རུང་སྟེ། རིག་སྔགས་འཆང་དེའི། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ།
en: One will be saved from all danger, disease, and vice, and all enemies, opponents, and adversaries will perish.

source: དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མས། དེ་བཞིན་གཤེགས་པ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུའི་དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་དགེ་བའི་རྩ་བ་ཆེན་པོ་བསྐྱེད་པར་འགྱུར་རོ།
en: The vidyā holder—be they a son or a daughter of good family, a monk or nun, or a male or female lay practitioner—who renders even a little service to the cloth painting by offering flowers, incense, scented oil, or cow dung; who consecrates a maṇḍala and sets out full jars; or who merely removes some dust will plant the roots of virtue as if in the presence of hundreds of thousands of millions of billions of tathāgatas, equaling in number the grains of sand in ninety-nine Gaṅgā rivers. “

source: །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་ཡང་འགྱུར་རོ།
en: Such a vidyā holder will accumulate a great amount of merit and fulfill the six perfections.

source: །མཚམས་མེད་པ་ལྔ་རྣམ་པར་སྦྱངས་ཤིང་བསྐལ་པའི་མཐར་ཐུག་པར་འགྱུར་རོ། །སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་གཟིགས་འདོད་པར་འགྱུར་རོ།
en: His five acts of immediate retribution will be cleared, his lifespan will increase to one hundred eons, and all buddhas and bodhisattvas will be willing to see him.

source: །སྐྱེ་བ་བརྗེས་ནས་ཀྱང་། འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་འགྲོ་བར་འགྱུར་ཏེ། པདྨ་ལས་བརྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ། །སྐྱེ་བའི་སྐྱེ་བ་དྲན་པར་ཡང་འགྱུར་རོ།
en: When his present life runs out, he will proceed to the realm of Sukhāvatī, where he will be spontaneously born from a lotus flower with the power to remember his successive rebirths.

source: །རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གསང་བ་པདྨ་ཡངས་པའི་དཀྱིལ་འཁོར། དོན་ཡོད་ཞགས་པའི་སྙིང་པོ། དོན་ཡོད་པའི་ཁྲོ་བོ་ལྕགས་ཀྱུའི་གཟུངས་འདི་ཡང་མཐའ་དག་ཡོངས་སུ་རྫོགས་པར་ཁ་ཏོན་དུ་གནས་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་རིགས་ཀྱི་དམ་ཚིག་གསང་བ་རྣམས་དང་།
en: Furthermore, this secret maṇḍala of liberation, the illustrious maṇḍala of the lotus family, and the dhāraṇī of Amogha­krodhāṅkuśa that constitutes the heart essence of Amoghapāśa, all of them complete, will remain on the tip of his tongue.

source: གསང་སྔགས་རིམ་པར་ཕྱེ་བ་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་དང་། དཀྱིལ་འཁོར་རིམ་པར་ཕྱེ་བ་དང་། ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་མངོན་སུམ་དུ་འགྱུར་རོ།
en: The secret samaya of all tathāgata families and the secret collections of mantras, mudrās, maṇḍalas, and rites will all remain immediately accessible to him. “

source: །སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར་རོ།
en: The vidyā holder will proceed from one buddha field to another, meeting all the tathāgatas face-to-face.

source: །ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་ཡང་འགྱུར་རོ།
en: He will acquire every good quality and attain all the perfections.

source: །དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པར་ཡང་འགྱུར་རོ། །བསོད་ནམས་ཀྱི་ཚོགས་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: He will plant the roots of every virtue and accumulate much merit.
